Конфигурация/InformationRegisters/КодыВоВнешнихСистемах.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.17">
	<InformationRegister>
		<Properties>
			<Name>КодыВоВнешнихСистемах</Name>
			<InformationRegisterPeriodicity>Day</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Код</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>55</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>ДопКод</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>55</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДопКод1</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>55</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДопКод0</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ХранилищеЗначения</Name>
					<Type>
						<v8:Type>v8:ValueStorage</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>ВнешняяСистема</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ВнешниеСистемы</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ГруппаОбъектов</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ГруппыИмпортируемыхОбъектов</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Объект</Name>
					<Type>
						<v8:TypeSet>cfg:DocumentRef</v8:TypeSet>
						<v8:TypeSet>cfg:CatalogRef</v8:TypeSet>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

Конфигурация/Enums/ВидыЗаявокПайщиков.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.17">
	<Enum>
		<Properties>
			<Name>ВидыЗаявокПайщиков</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Зачисление</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Погашение</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Обмен</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Конфигурация/Documents/ПервичнаяЗаявкаПайщика.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.17">
	<Document>
		<Properties>
			<Name>ПервичнаяЗаявкаПайщика</Name>
			<Posting>Deny</Posting>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВидЗаявки</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ВидыЗаявокПайщиков</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НомерЗаявки</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>10</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПИФ</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ПаевыеИнвестиционныеФонды</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Ответственный</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Document>
</MetaDataObject>

Конфигурация/Catalogs/ГруппыИмпортируемыхОбъектов.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.17">
	<Catalog>
		<Properties>
			<Name>ГруппыИмпортируемыхОбъектов</Name>
			<Hierarchical>true</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ВнешняяСистема</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ВнешниеСистемы</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

Конфигурация/Catalogs/Организации.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.17">
	<Catalog>
		<Properties>
			<Name>Организации</Name>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ЮрФизЛицо</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ЮрФизЛица</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПрефиксНумерации</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>3</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЗаголовокСистемы</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВалютаУчета</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Валюты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаНачалаУчета</Name>
					<Comment>Ранее этой даты проведение документов запрещено</Comment>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КонтрольОтветственныхЗаОперации</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КонтрольПодтвержденийОпераций</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КонтрольДоступаКСчетамДоверительногоУправления</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИдентификаторПапкиВФайловомХранилище</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>36</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

Конфигурация/CommonModules/ИнтеграцияСБэкОфисомУправляющейКомпанииСервер/Ext/Module.bsl
////////////////////////////////////////////////////////////////////////////////
// ИМПОРТ ЗАЯВОК ПАЙЩИКОВ

Процедура ИмпортироватьЗаявкиПайщиков(ДанныеЗаявокПайщиков) Экспорт
	
	Если НЕ РольДоступна("ИмпортДанныхИзУК77") Тогда
		Возврат;
	КонецЕсли;
	
	ЧтениеXML = Новый ЧтениеXML;
	ЧтениеXML.УстановитьСтроку(ДанныеЗаявокПайщиков);
	
	ПостроительDOM = Новый ПостроительDOM;
	ДокументDOM    = ПостроительDOM.Прочитать(ЧтениеXML);
	
	ПакетДанныхDOM = ДокументDOM.ДочерниеУзлы[0];
	
	ПериодССтрока = ПакетДанныхDOM.ПолучитьАтрибут("ПериодС");	
	ПериодПоСтрока = ПакетДанныхDOM.ПолучитьАтрибут("ПериодПо");	
	
	ПериодС = Дата(Прав(ПериодССтрока, 4), Сред(ПериодССтрока, 4, 2), Лев(ПериодССтрока, 2));
	ПериодПо = Дата(Прав(ПериодПоСтрока, 4), Сред(ПериодПоСтрока, 4, 2), Лев(ПериодПоСтрока, 2));
	
	OrganizationID = ПакетДанныхDOM.ПолучитьАтрибут("OrganizationID"); 
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	Организации.Ссылка
		|ИЗ
		|	РегистрСведений.КодыВоВнешнихСистемах.СрезПоследних(
		|			&Период,
		|			ВнешняяСистема = ЗНАЧЕНИЕ(Справочник.ВнешниеСистемы.Матрих)
		|				И ГруппаОбъектов = ЗНАЧЕНИЕ(Справочник.ГруппыИмпортируемыхОбъектов.ЮридическиеЛица)
		|				И Код = &Код) КАК КодыВоВнешнихСистемахСрезПоследних
		|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.Организации КАК Организации
		|		ПО КодыВоВнешнихСистемахСрезПоследних.Объект = Организации.ЮрФизЛицо";

	Запрос.УстановитьПараметр("Код", OrganizationID);
	Запрос.УстановитьПараметр("Период", ПериодПО);

	РезультатЗапроса = Запрос.Выполнить();

	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();

	Если ВыборкаДетальныеЗаписи.Следующий() Тогда
		Организация = ВыборкаДетальныеЗаписи.Ссылка;
	Иначе
		Возврат;
	КонецЕсли;
	
	ЗаявкиПайщиков = ПакетДанныхDOM.ДочерниеУзлы[0];
	
	ТаблЗаявок = Новый ТаблицаЗначений;
	ТаблЗаявок.Колонки.Добавить("ИДЗаявки",		Новый ОписаниеТипов("Строка", Новый КвалификаторыСтроки(55)));
	ТаблЗаявок.Колонки.Добавить("Номер",		Новый ОписаниеТипов("Строка", Новый КвалификаторыСтроки(10)));
	ТаблЗаявок.Колонки.Добавить("Дата",			Новый ОписаниеТипов("Дата"));
	ТаблЗаявок.Колонки.Добавить("ПИФ",			Новый ОписаниеТипов("СправочникСсылка.ПаевыеИнвестиционныеФонды"));
	ТаблЗаявок.Колонки.Добавить("ВидЗаявки",	Новый ОписаниеТипов("ПеречислениеСсылка.ВидыЗаявокПайщиков"));
	ТаблЗаявок.Колонки.Добавить("Комментарий",	Новый ОписаниеТипов("Строка", Новый КвалификаторыСтроки(100)));
	
	Для каждого ЗаявкаПайщиков Из ЗаявкиПайщиков.ДочерниеУзлы Цикл
		
		СтрокаЗаявок = ТаблЗаявок.Добавить();
		
		СчетДУ = Справочники.СчетаДоверительногоУправления.НайтиПоРеквизиту("КодСчета", ЗаявкаПайщиков.ПолучитьАтрибут("ПИФ"));
		
		ДатаЗ  = ЗаявкаПайщиков.ПолучитьАтрибут("Дата");
		ВремяЗ = ЗаявкаПайщиков.ПолучитьАтрибут("Время");
		
		СтрокаЗаявок.Дата        = Дата(Прав(ДатаЗ, 4), Сред(ДатаЗ, 4, 2), Лев(ДатаЗ, 2), Лев(ВремяЗ, 2), Сред(ВремяЗ, 4, 2), Прав(ВремяЗ, 2));
		СтрокаЗаявок.ИДЗаявки    = ЗаявкаПайщиков.ПолучитьАтрибут("ИДЗаявки");
		СтрокаЗаявок.Номер       = ЗаявкаПайщиков.ПолучитьАтрибут("НомерЗаявки");
		СтрокаЗаявок.ПИФ         = Справочники.СчетаДоверительногоУправления.КлиентДоверительногоУправления(СчетДУ, СтрокаЗаявок.Дата);
		СтрокаЗаявок.ВидЗаявки   = ?(ЗаявкаПайщиков.ПолучитьАтрибут("ТипЗаявки") = "Погашение паев", Перечисления.ВидыЗаявокПайщиков.Погашение, Перечисления.ВидыЗаявокПайщиков.Зачисление);
		СтрокаЗаявок.Комментарий = ЗаявкаПайщиков.ПолучитьАтрибут("Комментарий");		
		
	КонецЦикла;
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	ТаблЗаявок.Номер,
		|	ТаблЗаявок.Дата,
		|	ТаблЗаявок.ПИФ,
		|	ТаблЗаявок.ИДЗаявки,
		|	ТаблЗаявок.Комментарий,
		|	ТаблЗаявок.ВидЗаявки
		|ПОМЕСТИТЬ ТаблЗаявок
		|ИЗ
		|	&ТаблЗаявок КАК ТаблЗаявок
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	ТаблЗаявок.Номер,
		|	ТаблЗаявок.Дата,
		|	ТаблЗаявок.ПИФ,
		|	ТаблЗаявок.ИДЗаявки,
		|	ТаблЗаявок.Комментарий,
		|	ТаблЗаявок.ВидЗаявки
		|ИЗ
		|	ТаблЗаявок КАК ТаблЗаявок
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	КодыВоВнешнихСистемахСрезПоследних.Объект,
		|	ТаблЗаявок.Номер,
		|	ТаблЗаявок.Дата,
		|	ТаблЗаявок.ПИФ,
		|	ТаблЗаявок.ИДЗаявки,
		|	ТаблЗаявок.Комментарий,
		|	ТаблЗаявок.ВидЗаявки
		|ПОМЕСТИТЬ ЗаявкиПайщиковИз77
		|ИЗ
		|	ТаблЗаявок КАК ТаблЗаявок
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.КодыВоВнешнихСистемах.СрезПоследних(
		|				&КонДата,
		|				ВнешняяСистема = &ВнешняяСистема
		|					И ГруппаОбъектов = &ГруппаОбъектов) КАК КодыВоВнешнихСистемахСрезПоследних
		|		ПО ТаблЗаявок.ИДЗаявки = КодыВоВнешнихСистемахСрезПоследних.Код
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	ЗаявкиПайщиковИз77.Объект,
		|	ЗаявкиПайщиковИз77.Номер,
		|	ЗаявкиПайщиковИз77.Дата,
		|	ЗаявкиПайщиковИз77.ПИФ,
		|	ЗаявкиПайщиковИз77.ИДЗаявки,
		|	ЗаявкиПайщиковИз77.Комментарий,
		|	ЗаявкиПайщиковИз77.ВидЗаявки
		|ИЗ
		|	ЗаявкиПайщиковИз77 КАК ЗаявкиПайщиковИз77
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	ПервичнаяЗаявкаПайщика.Ссылка,
		|	ПервичнаяЗаявкаПайщика.НомерЗаявки КАК Номер,
		|	ПервичнаяЗаявкаПайщика.Дата,
		|	ПервичнаяЗаявкаПайщика.ПИФ,
		|	ПервичнаяЗаявкаПайщика.Комментарий,
		|	ПервичнаяЗаявкаПайщика.ВидЗаявки,
		|	КодыВоВнешнихСистемахСрезПоследних.Код КАК ИДЗаявки
		|ПОМЕСТИТЬ ЗаявкиПайщиковИз8
		|ИЗ
		|	Документ.ПервичнаяЗаявкаПайщика КАК ПервичнаяЗаявкаПайщика
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.КодыВоВнешнихСистемах.СрезПоследних(
		|				&КонДата,
		|				ВнешняяСистема = &ВнешняяСистема
		|					И ГруппаОбъектов = &ГруппаОбъектов) КАК КодыВоВнешнихСистемахСрезПоследних
		|		ПО ПервичнаяЗаявкаПайщика.Ссылка = КодыВоВнешнихСистемахСрезПоследних.Объект
		|ГДЕ
		|	ПервичнаяЗаявкаПайщика.Дата >= &НачДата
		|	И ПервичнаяЗаявкаПайщика.Дата <= &КонДата
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	ЗаявкиПайщиковИз8.Ссылка,
		|	ЗаявкиПайщиковИз8.Номер,
		|	ЗаявкиПайщиковИз8.Дата,
		|	ЗаявкиПайщиковИз8.ПИФ,
		|	ЗаявкиПайщиковИз8.Комментарий,
		|	ЗаявкиПайщиковИз8.ВидЗаявки,
		|	ЗаявкиПайщиковИз8.ИДЗаявки
		|ИЗ
		|	ЗаявкиПайщиковИз8 КАК ЗаявкиПайщиковИз8
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	ЗаявкиПайщиковИз8.Ссылка,
		|	ЗаявкиПайщиковИз77.Номер,
		|	ЗаявкиПайщиковИз77.Дата,
		|	ЗаявкиПайщиковИз77.ПИФ,
		|	ЗаявкиПайщиковИз77.ВидЗаявки,
		|	ЗаявкиПайщиковИз77.Комментарий,
		|	ЗаявкиПайщиковИз8.Номер КАК Номер8,
		|	ЗаявкиПайщиковИз8.Дата КАК Дата8,
		|	ЗаявкиПайщиковИз8.ПИФ КАК ПИФ8,
		|	ЗаявкиПайщиковИз8.ВидЗаявки КАК ВидЗаявки8,
		|	ЗаявкиПайщиковИз8.Комментарий КАК Комментарий8,
		|	ЗаявкиПайщиковИз77.Объект,
		|	ЗаявкиПайщиковИз77.ИДЗаявки
		|ПОМЕСТИТЬ ВсеЗаявки
		|ИЗ
		|	ЗаявкиПайщиковИз77 КАК ЗаявкиПайщиковИз77
		|		ПОЛНОЕ СОЕДИНЕНИЕ ЗаявкиПайщиковИз8 КАК ЗаявкиПайщиковИз8
		|		ПО ЗаявкиПайщиковИз77.ИДЗаявки = ЗаявкиПайщиковИз8.ИДЗаявки
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	ВсеЗаявки.Ссылка,
		|	ВсеЗаявки.Номер,
		|	ВсеЗаявки.Дата,
		|	ВсеЗаявки.ПИФ,
		|	ВсеЗаявки.ВидЗаявки,
		|	ВсеЗаявки.Комментарий,
		|	ВсеЗаявки.Номер8,
		|	ВсеЗаявки.Дата8,
		|	ВсеЗаявки.ПИФ8,
		|	ВсеЗаявки.ВидЗаявки8,
		|	ВсеЗаявки.Комментарий8,
		|	ВсеЗаявки.Объект,
		|	ВсеЗаявки.ИДЗаявки
		|ИЗ
		|	ВсеЗаявки КАК ВсеЗаявки
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	ВсеЗаявки.Ссылка,
		|	ВсеЗаявки.Номер,
		|	ВсеЗаявки.Дата,
		|	ВсеЗаявки.ПИФ,
		|	ВсеЗаявки.ИДЗаявки,
		|	ВсеЗаявки.ВидЗаявки,
		|	ВсеЗаявки.Комментарий,
		|	ВсеЗаявки.Объект
		|ИЗ
		|	ВсеЗаявки КАК ВсеЗаявки
		|ГДЕ
		|	(ВсеЗаявки.Ссылка ЕСТЬ NULL 
		|			ИЛИ ВсеЗаявки.Объект ЕСТЬ NULL 
		|			ИЛИ ВсеЗаявки.Дата <> ВсеЗаявки.Дата8
		|			ИЛИ ВсеЗаявки.Номер <> ВсеЗаявки.Номер8
		|			ИЛИ ВсеЗаявки.ПИФ <> ВсеЗаявки.ПИФ8
		|			ИЛИ ВсеЗаявки.ВидЗаявки <> ВсеЗаявки.ВидЗаявки8)";
	
		
	Запрос.УстановитьПараметр("ТаблЗаявок",		ТаблЗаявок);
	Запрос.УстановитьПараметр("ГруппаОбъектов",	Справочники.ГруппыИмпортируемыхОбъектов.ПолучитьГруппуПоНаименованию("ЗаявкиПайщиков"));
	Запрос.УстановитьПараметр("НачДата",		ПериодС);
	Запрос.УстановитьПараметр("КонДата",		ПериодПО);
	Запрос.УстановитьПараметр("ВнешняяСистема",	Справочники.ВнешниеСистемы.Расм77);
	
	ТаблЗаявокКЗакачке = Запрос.Выполнить().Выгрузить();
	
	Для каждого СтрокаЗаявокКЗакачке Из ТаблЗаявокКЗакачке Цикл
	
		Если СтрокаЗаявокКЗакачке.Ссылка = NULL Тогда //Нужно загрузить заявку
			// сама заявка
			ДокументЗаявка = Документы.ПервичнаяЗаявкаПайщика.СоздатьДокумент();
			
			ДокументЗаявка.НомерЗаявки = СтрокаЗаявокКЗакачке.Номер;
			ДокументЗаявка.Дата = СтрокаЗаявокКЗакачке.Дата;
			ДокументЗаявка.Организация = Организация;
			ДокументЗаявка.ВидЗаявки = СтрокаЗаявокКЗакачке.ВидЗаявки;
			ДокументЗаявка.ПИФ = СтрокаЗаявокКЗакачке.ПИФ;
			ДокументЗаявка.Ответственный = РаботаСПользователями.ТекущийПользователь();
			ДокументЗаявка.Комментарий = СтрокаЗаявокКЗакачке.Комментарий;
			
			ДокументЗаявка.Записать();
			
			// код во внешней системе
			МенеджерЗаписи = РегистрыСведений.КодыВоВнешнихСистемах.СоздатьМенеджерЗаписи();
			МенеджерЗаписи.Период         = Дата(1980, 1, 1);
			МенеджерЗаписи.ВнешняяСистема = Справочники.ВнешниеСистемы.Расм77;
			МенеджерЗаписи.ГруппаОбъектов = Справочники.ГруппыИмпортируемыхОбъектов.ПолучитьГруппуПоНаименованию("ЗаявкиПайщиков");
			МенеджерЗаписи.Объект         = ДокументЗаявка.Ссылка;
			МенеджерЗаписи.Код            = СтрокаЗаявокКЗакачке.ИДЗаявки;
			МенеджерЗаписи.Записать();
			
		ИначеЕсли СтрокаЗаявокКЗакачке.Объект = NULL Тогда //Нужно удалить 8чную заявку
			
			ДокументЗаявка = СтрокаЗаявокКЗакачке.Ссылка.ПолучитьОбъект();
			ДокументЗаявка.УстановитьПометкуУдаления(Истина);
				
		Иначе //Нужно обновить заявку
			
			ДокументЗаявка = СтрокаЗаявокКЗакачке.Ссылка.ПолучитьОбъект();
			
			ДокументЗаявка.НомерЗаявки = СтрокаЗаявокКЗакачке.Номер;
			ДокументЗаявка.Дата = СтрокаЗаявокКЗакачке.Дата;
			ДокументЗаявка.Организация = Организация;
			ДокументЗаявка.ВидЗаявки = СтрокаЗаявокКЗакачке.ВидЗаявки;
			ДокументЗаявка.ПИФ = СтрокаЗаявокКЗакачке.ПИФ;
			ДокументЗаявка.Комментарий = СтрокаЗаявокКЗакачке.Комментарий;
			ДокументЗаявка.Ответственный = РаботаСПользователями.ТекущийПользователь();
			
			ДокументЗаявка.Записать();
			
		КонецЕсли;	
	
	КонецЦикла;
	
КонецПроцедуры

////////////////////////////////////////////////////////////////////////////////

Процедура ОтправитьОтчетыHTMLПоЭлПочте(Кому, Тема, Отчет) Экспорт
	
	ПараметрыПисьма = Новый Структура("Кому, Тема, Тело, ТипТекста",
		Кому,
		Тема,
		Отчет,
		"HTML");
		
	РаботаСЭлектроннойПочтой.ОтправитьЭлектронноеПисьмо(РаботаСЭлектроннойПочтой.ПолучитьСистемнуюУчетнуюЗапись(), ПараметрыПисьма);
	
КонецПроцедуры // ОтправитьОтчетыHTMLПоЭлПочте
